script
clc
clear
disp('% кп ╧4 дот б сякнбхъу пюярейюмхъ яоейрпю')
disp('%')
disp('% бБЕДХРЕ хяундмше дюммше')
DATA=0;
while DATA==0
N = input('N = ');        % дкхмю (оепхнд) онякеднбюрекэмнярх
Fs = input('Fs = ');      % вюярнрю дхяйперхгюжхх (цЖ)
A1 = input('A1 = ');      % юлокхрсдш дхяйпермшу цюплнмхй
A2 = input('A2 = ');
f1 = input('f1 = ');      % вюярнрш дхяйпермшу цюплнмхй (цЖ)
f2 = input('f2 = ');
M = input('M = ');    % оепхнд онякеднбюрекэмнярх M
disp('% оПНБЕПЭРЕ опюбхкэмнярэ ББНДЮ хяундмшу дюммшу')
disp('% оПХ опюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 1')
disp('% оПХ меопюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 0 Х онбрнпхре ББНД')
DATA = input('--> ');
end
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('% О.1. опнбепйю пюбемярбю оюпяебюкъ')
n = 0:(N-1);              % дхяйпермне мнплхпнбюммне бпелъ
w1 = 2*pi*f1/Fs; w2 = 2*pi*f2/Fs;  % мнплхпнбюммше вюярнрш дхяйпермшу цюплнмхй (пюд)
x = A1*cos(w1*n)+A2*cos(w2*n);     % онякеднбюрекэмнярэ(оепхнд N)
X = fft(x);               % дот онякеднбюрекэмнярх
E1 = sum(x.^2);           % щмепцхъ онякеднбюрекэмнярх, бшвхякеммюъ он ее нряверюл
E2 = (1/N)*sum(abs(X).^2); % щмепцхъ онякеднбюрекэмнярх, бшвхякеммюъ он нряверюл дот
disp('%')
disp('% дКЪ БШБНДЮ КЕБНИ (E1) Х ОПЮБНИ (E2) ВЮЯРЕИ пюбемярбю оюпяебюкъ (ДКХМЮ ОНЯКЕДНБЮРЕКЭМНЯРХ N) МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp(['      E1 = ',num2str(E1),'      E2 = ' num2str(E2)])
disp('%')
n1 = 0:(M-1);         % дхяйпермне мнплхпнбюммне бпелъ (оепхнд M)
w1 = 2*pi*f1/Fs; w2 = 2*pi*f2/Fs;  % мнплхпнбюммше вюярнрш дхяйпермшу цюплнмхй (пюд)
x = A1*cos(w1*n1)+A2*cos(w2*n1);     % онякеднбюрекэмнярэ(оепхнд M)
X = fft(x);               % дот онякеднбюрекэмнярх
E3 = sum(x.^2);           % щмепцхъ онякеднбюрекэмнярх, бшвхякеммюъ он ее нряверюл
E4 = (1/M)*sum(abs(X).^2); % щмепцхъ онякеднбюрекэмнярх, бшвхякеммюъ он нряверюл дот
disp('% дКЪ БШБНДЮ КЕБНИ (E3) Х ОПЮБНИ (E4) ВЮЯРЕИ пюбемярбю оюпяебюкъ (ДКХМЮ ОНЯКЕДНБЮРЕКЭМНЯРХ M)МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp(['      E3 = ',num2str(E3),'      E4 = ' num2str(E4)])
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('% О.2. хяякеднбюмхе щттейрю пюярейюмхъ яоейрпю дкъ ндмни дхяйпермни цюплнмхйх')
disp('%')
w1 = 2*pi*f1/Fs;      % мнплхпнбюммюъ вюярнрю (пюд)
x_N = A1*cos(w1*n);   % онякеднбюрекэмнярэ (оепхнд N)
X_N = fft(x_N);       % дот онякеднбюрекэмнярх (оепхнд N)
MOD_N = (2/N)*abs(X_N);  % юлокхрсдмши яоейрп онякеднбюрекэмнярх (оепхнд N)
MOD_N(1) = (1/N)*abs(X_N(1));
k1 = 0:(M-1);         % дхяйпермюъ мнплхпнбюммюъ вюярнрю (оепхнд M)
x_M = A1*cos(w1*n1);  % онякеднбюрекэмнярэ (оепхнд M)
X_M = fft(x_M);          % дот онякеднбюрекэмнярх (оепхнд M)
MOD_M = (2/M)*abs(X_M);  % юлокхрсдмши яоейрп онякеднбюрекэмнярх (оепхнд M)
MOD_M(1) = (1/M)*abs(X_M(1));
P_N = N*f1/Fs;        % вхякн оепхнднб дхяйпермни цюплнмхйх я вюярнрни f1 мю оепхнде онякеднбюрекэмнярх N
P_M = M*f1/Fs;        % вхякн оепхнднб дхяйпермни цюплнмхйх я вюярнрни f1 мю оепхнде онякеднбюрекэмнярх M
disp('% дКЪ БШБНДЮ вхякю оепхнднб ДХЯЙПЕРМНИ ЦЮПЛНМХЙХ я вюярнрни f1 МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp(['N = ',num2str(N),'  -->  P_N = ' num2str(P_N)])
disp(['M = ',num2str(M),'  -->  P_M = ' num2str(P_M)])
disp('%')
disp('% дКЪ БШБНДЮ цпютхйнб юлокхрсдмшу яоейрпнб МЮФЛХРЕ <ENTER>')
pause
k = 0:(N-1);         % дхяйпермюъ мнплхпнбюммюъ вюярнрю (оепхнд N)
figure('Name','юЛОКХРСДМШЕ ЯОЕЙРПШ','NumberTitle', 'off')
subplot(2,1,1), stem(k,MOD_N,'MarkerSize',3), grid, xlabel('k')
title(strcat(['юЛОКХРСДМШИ ЯОЕЙРП ОЕПХНДХВЕЯЙНИ ОНЯКЕДНБЮРЕКЭМНЯРХ N = ',num2str(N)]))
subplot(2,1,2), stem(k1,MOD_M,'MarkerSize',3), grid, xlabel('k')
title(strcat(['юЛОКХРСДМШИ ЯОЕЙРП ОЕПХНДХВЕЯЙНИ ОНЯКЕДНБЮРЕКЭМНЯРХ M = ',num2str(M)]))
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('% О.3. хяякеднбюмхе бнглнфмнярх слемэьемхъ пюярейюмхъ яоейрпю я онлныэч нймю')
win_M  = hamming(M)';    % нймн ущллхмцю ≈ бейрнп-ярнкаеж дкхмш M
xw_M = x_M.*win_M;       % онякеднбюрекэмнярэ, бгбеьеммюъ нймнл
XW_M = fft(xw_M);        % дот бгбеьеммни онякеднбюрекэмнярх
MODW_M =(2/M)*abs(XW_M); % юлокхрсдмши яоейрп бгбеьеммни онякеднбюрекэмнярх
MODW_M(1) =(1/M)*abs(XW_M(1));
disp('%')
disp('% дКЪ БШБНДЮ цпютхйнб юлокхрсдмшу яоейрпнб дн Х оняке ОПХЛЕМЕМХЪ нймю МЮФЛХРЕ <ENTER>')
pause
figure('Name','сЛЕМЭЬЕМХЕ ПЮЯРЕЙЮМХЪ ЯОЕЙРПЮ Я ОНЛНЫЭЧ НЙНММШУ ТСМЙЖХИ','NumberTitle', 'off')
subplot(2,1,1), stem(k1,MOD_M,'MarkerSize',3), grid, xlabel('k')
title(strcat(['юЛОКХРСДМШИ ЯОЕЙРП Я ОПЪЛНСЦНКЭМШЛ НЙМНЛ M = ',num2str(M)]))
subplot(2,1,2), stem(k1,MODW_M,'MarkerSize',3), grid, xlabel('k')
title(strcat(['юЛОКХРСДМШИ ЯОЕЙРП Я НЙМНЛ уЩЛЛХМЦЮ M = ',num2str(M)]))
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('% О.4. хяякеднбюмхе щттейрю пюярейюмхъ яоейрпю дкъ ясллш дбсу дхяйпермшу цюплнмхй')
disp('%')
disp('% бБЕДХРЕ хяундмше дюммше')
DATA=0;
while DATA==0
f1_1 = input('f1_1 = ');   % вюярнрш дхяйпермшу цюплнмхй (цЖ)
f2_1 = input('f2_1 = ');
disp('% оПНБЕПЭРЕ опюбхкэмнярэ ББНДЮ хяундмшу дюммшу')
disp('% оПХ опюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 1')
disp('% оПХ меопюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 0 Х онбрнпхре ББНД')
DATA = input('--> ');
end
w1_1 = 2*pi*f1_1/Fs; w2_1 = 2*pi*f2_1/Fs; % мнплхпнбюммше вюярнрш дхяйпермшу цюплнмхй (пюд)
x1 = A1*cos(w1_1*n)+A2*cos(w2_1*n);  % онякеднбюрекэмнярэ (оепхнд N)
X1 = fft(x1);           % дот онякеднбюрекэмнярх (оепхнд N)
MOD1 = (2/N)*abs(X1);   % юлокхрсдмши яоейрп онякеднбюрекэмнярх
MOD1(1) = (1/N)*abs(X1(1));
P1_1 = N*f1_1/Fs;        % вхякн оепхнднб дхяйпермни цюплнмхйх я вюярнрни f1_1 мю оепхнде онякеднбюрекэмнярх N
P2_1 = N*f2_1/Fs;        % вхякн оепхнднб дхяйпермни цюплнмхйх я вюярнрни f2_1 мю оепхнде онякеднбюрекэмнярх N
disp('%')
disp('% дКЪ БШБНДЮ вхякю оепхнднб ДХЯЙПЕРМШУ ЦЮПЛНМХЙ я вюярнрюлх f1_1 Х f2_1 МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp(['      f1_1 = ',num2str(f1_1),'  -->  P1_1 = ' num2str(P1_1)])
disp(['      f2_1 = ',num2str(f2_1),'  -->  P2_1 = ' num2str(P2_1)])
win_N  = hamming(N)';     % нймн ущллхмцю ≈ бейрнп-ярнкаеж дкхмш N
xw1 = x1.*win_N;   % онякеднбюрекэмнярэ, бгбеьеммюъ нймнл (оепхнд N)
XW1 = fft(xw1);    % дот бгбеьеммни онякеднбюрекэмнярх (оепхнд N)
MODW1 =(2/N)*abs(XW1);   % юлокхрсдмши яоейрп онякеднбюрекэмнярх
MODW1(1) =(1/M)*abs(XW1(1));
disp('%')
disp('% дКЪ БШБНДЮ цпютхйнб юлокхрсдмшу яоейрпнб дн Х оняке ОПХЛЕМЕМХЪ нймю МЮФЛХРЕ <ENTER>')
pause
figure('Name','сЛЕМЭЬЕМХЕ ПЮЯРЕЙЮМХЪ ЯОЕЙРПЮ Я ОНЛНЫЭЧ НЙНММШУ ТСМЙЖХИ','NumberTitle', 'off')
subplot(2,1,1), stem(k,MOD1,'MarkerSize',3), grid, xlabel('k')
title(strcat(['юЛОКХРСДМШИ ЯОЕЙРП Я ОПЪЛНСЦНКЭМШЛ НЙМНЛ N = ',num2str(N)]))
subplot(2,1,2), stem(k,MODW1,'MarkerSize',3), grid, xlabel('k')
title(strcat(['юЛОКХРСДМШИ ЯОЕЙРП Я НЙМНЛ уЩЛЛХМЦЮ N = ',num2str(N)]))
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('% О.5. сксвьемхе пюгкхвемхъ дхяйпермшу цюплнмхй я акхгйн пюяонкнфеммшлх вюярнрюлх')
disp('%')
disp('% бБЕДХРЕ хяундмше дюммше')
DATA=0;
while DATA==0
f1_2 = input('f1_2 = ');        % вюярнрш дхяйпермшу цюплнмхй (цЖ)
f2_2 = input('f2_2 = ');
disp('% оПНБЕПЭРЕ опюбхкэмнярэ ББНДЮ хяундмшу дюммшу')
disp('% оПХ опюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 1')
disp('% оПХ меопюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 0 Х онбрнпхре ББНД')
DATA = input('--> ');
end
disp('%')
disp('% дКЪ БШБНДЮ оепхндю онякеднбюрекэмнярх Х')
disp('% вюярнр цюплнмхй МЮФЛХРЕ <ENTER>')
disp('%')
disp(['      N = ',num2str(N)])
disp(['      f1_2 = ',num2str(f1_2),'       f2_2 = ' num2str(f2_2)])
Delta_N = Fs/N;                   % пюгпеьемхе он вюярнре
Delta_f = abs(f1_2-f2_2);         % пюяярнъмхе лефдс вюярнрюлх
L = ceil(Fs/(Delta_f-Delta_N));   % бшапюммюъ дкхмю L
Delta_L = Fs/L;        % оепхнд дхяйперхгюжхх он вюярнре опх дкхме L
disp('%')
disp('% дКЪ БШБНДЮ пюгпеьемхъ он вюярнре Delta_N,')
disp('% пюяярнъмхъ ЛЕФДС вюярнрюлх Delta_f,')
disp('% дкхмш L ОНЯКЕДНБЮРЕКЭМНЯРХ')
disp('% Х оепхндю дхяйперхгюжхх он вюярнре Delta_L МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp(['      Delta_N = ',num2str(Delta_N)])
disp(['      Delta_f = ',num2str(Delta_f)])
disp(['      L = ',num2str(L)])
disp(['      Delta_L = ',num2str(Delta_L)])
disp('%')
w1_2 = 2*pi*f1_2/Fs; w2_2 = 2*pi*f2_2/Fs; % мнплхпнбюммше вюярнрш
x2 = A1*cos(w1_2*n)+A2*cos(w2_2*n);       % йнмевмюъ онякеднбюрекэмнярэ
X2 = fft(x2);              % дот йнмевмни онякеднбюрекэмнярх дкхмш N
MOD2 = abs(X2);            % лндскэ дот
X2_L = fft(x2,L);          % дот йнмевмни онякеднбюрекэмнярх, днонкмеммни мскълх дн дкхмш L
MOD2_L = abs(X2_L);        % лндскэ дот
disp('% дКЪ БШБНДЮ цпютхйнб N-рнвевмнцн дот Х лндскъ яоейрпюкэмни')
disp('% окнрмнярх, бняярюмнбкеммни он L рнвйюл, МЮФЛХРЕ <ENTER>')
pause
k1 = 0:(L-1);         % дхяйпермюъ мнплхпнбюммюъ вюярнрю опх дкхме L
figure('Name','дХЯЙПЕРМШИ ЦЮПЛНМХВЕЯЙХИ ЯХЦМЮК Я АКХГЙН ПЮЯОНКНФЕММШЛХ ВЮЯРНРЮЛХ','NumberTitle', 'off')
subplot(2,1,1), stem(k,MOD2), grid, xlabel('k')
title(strcat(['лНДСКЭ дот N = ',num2str(N)]))
subplot(2,1,2), plot(k1,MOD2_L,'r','MarkerSize',3, 'Linewidth',2)
grid, hold on, stem(k1,MOD2_L,':'), xlabel('k')
title(strcat(['лНДСКЭ ЯОЕЙРПЮКЭМНИ ОКНРМНЯРХ L = ',num2str(L)]))
L_2 = ceil(L/2);                     % нямнбмюъ онкняю вюярнр L/2
[MODm, m]= max(MOD2_L(1:(L_2)));      % люйяхлсл MODm х хмдейя m бейрнпю MOD2_L (оепбши охй)
k_1 = (m-1); f_1 = k_1*Delta_L;      % дхяйпермюъ мнплхпнбюммюъ х юаянкчрмюъ (цЖ) вюярнрш оепбнцн охйю
K = ceil(L/N);   % йнкхвеярбн нрявернб мю оепхнде дхяйперхгюжхх Fs/N
K1 = m+K; K2 = m+2*K-1;              % мхфмъъ K1 Х бепумъъ K2 цпюмхжш хмрепбюкю опх онхяйе брнпнцн охйю яопюбю
[MODm1, m1]= max(MOD2_L(K1:K2));      % люйяхлсл MODm1 х хмдейя m1 лндскъ дот MOD2_L мю хмрепбюке [K1 K2]
K3 = m-(2*K-1); K4 = m-K;            % мхфмъъ K3 Х бепумъъ K4 цпюмхжш хмрепбюкю опх онхяйе брнпнцн охйю якебю
[MODm2, m2]= max(MOD2_L(K3:K4));      % люйяхлсл MODm2 х хмдейя m2 лндскъ дот MOD2_L мю хмрепбюке [K3 K4]
if (MODm1>MODm2)
    k_2 = (K1+m1-1)-1; f_2 = k_2*Delta_L; % дхяйпермюъ мнплхпнбюммюъ х юаянкчрмюъ (цЖ) вюярнрш брнпнцн охйю, еякх нм яопюбю нр оепбнцн
    else
    k_2 = (K3+m2-1)-1; f_2 = k_2*Delta_L; % дхяйпермюъ мнплхпнбюммюъ х юаянкчрмюъ (цЖ) вюярнрш брнпнцн охйю, еякх нм якебю нр оепбнцн
end
disp('%')
disp('% дКЪ БШБНДЮ вюярнр цюплнмхй МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp(['      k_1 = ',num2str(k_1),'      f_1 = ' num2str(f_1)])
disp(['      k_2 = ',num2str(k_2),'      f_2 = ' num2str(f_2)])
disp('%')
disp('% нОПЕДЕКХРЕ вюярнрш цюплнмхй ОН цпютхйс')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('% пюанрю гюбепьемю')
win_N  = hann(N)';     % нймн ущммхмцю ≈ бейрнп-ярнкаеж дкхмш N
xw2 = x1.*win_N;   % онякеднбюрекэмнярэ, бгбеьеммюъ нймнл (оепхнд N)
XW2 = fft(xw2);    % дот бгбеьеммни онякеднбюрекэмнярх (оепхнд N)
MODW2 =(2/N)*abs(XW2);   % юлокхрсдмши яоейрп онякеднбюрекэмнярх
MODW2(1) =(1/M)*abs(XW2(1));
disp('%')
disp('% дКЪ БШБНДЮ цпютхйнб юлокхрсдмшу яоейрпнб дн Х оняке ОПХЛЕМЕМХЪ нймю МЮФЛХРЕ <ENTER>')
pause
figure('Name','сЛЕМЭЬЕМХЕ ПЮЯРЕЙЮМХЪ ЯОЕЙРПЮ Я ОНЛНЫЭЧ НЙНММШУ ТСМЙЖХИ','NumberTitle', 'off')
subplot(2,1,1), stem(k,MOD1,'MarkerSize',3), grid, xlabel('k')
title(strcat(['юЛОКХРСДМШИ ЯОЕЙРП Я ОПЪЛНСЦНКЭМШЛ НЙМНЛ N = ',num2str(N)]))
subplot(2,1,2), stem(k,MODW2,'MarkerSize',3), grid, xlabel('k')
title(strcat(['юЛОКХРСДМШИ ЯОЕЙРП Я НЙМНЛ уЩММХМЦЮ N = ',num2str(N)]))
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('% пюанрю гюбепьемю')




























































































